БухЭксп/Catalogs/CW_ЛогистическиеСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЛогистическиеСтатусы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЦвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_МеханизмыРаскраскиСписковМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_МеханизмыРаскраскиСписковМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРаскрашивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныеЦвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветаСтатусов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЛогистическиеСтатусы/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьЛогистическиеСтатусыГрузоперевозок 	= ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок");
	ИспользоватьЛогистическиеСтатусыЗаказов			= ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаказов");
	ИспользоватьЛогистическиеСтатусыЗаявок			= ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаявок");
	
	Если НЕ ИспользоватьЛогистическиеСтатусыГрузоперевозок  
		 И	НЕ ИспользоватьЛогистическиеСтатусыЗаказов  
		 И	НЕ ИспользоватьЛогистическиеСтатусыЗаявок Тогда
		Элементы.Группа1.Видимость = ложь;
		Возврат;
	КонецЕсли;
	
	ДоступностьЗначенияОтбора = Истина;
	Если Параметры.Свойство("ЗначениеОтбора") Тогда
		ЗначениеОтбора = Параметры.ЗначениеОтбора;
		ДоступностьЗначенияОтбора = Ложь;
	КонецЕсли;
	
	Элементы.ЗначениеОтбора.Доступность = ДоступностьЗначенияОтбора;
	
	МеханизмРаскраски = ПредопределенноеЗначение("Перечисление.CW_МеханизмыРаскраскиСписковМониторинга.НеРаскрашивать");
	
	СоответствиеИменКонстант = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеИменКонстантМеханимаРасскраски();
	ИмяКонстанты = СоответствиеИменКонстант.Получить(Тип("СправочникСсылка.CW_Заказы"));
	Если ИмяКонстанты <> Неопределено Тогда
		МеханизмРаскраски = Константы[ИмяКонстанты].Получить();
	КонецЕсли;
	
	ИспользуетсяМеханизмРаскраски = МеханизмРаскраски = ПредопределенноеЗначение("Перечисление.CW_МеханизмыРаскраскиСписковМониторинга.ЦветаСтатусов");

	ЗаполнитьСписокДоступныхОбъектов(Не ДоступностьЗначенияОтбора);
	
	УстановитьОтборСпискаНаСервере();
	
	УстановитьУсловноеОформлениеСписка();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЛогистическогоСтатуса" Тогда
		УстановитьУсловноеОформлениеСписка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтбораПриИзменении(Элемент)
	
	УстановитьОтборСпискаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаНаСервере()

	Список.Отбор.Элементы.Очистить();
	
	НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ИдентификаторОбъекта");
	НовыйЭлемент.ВидСравнения  		= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлемент.ПравоеЗначение   	= ЗначениеОтбора;
	НовыйЭлемент.Использование 		= Истина ;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСписка()
	
	ЭтаФорма.Список.УсловноеОформление.Элементы.Очистить();
	Если Не ИспользуетсяМеханизмРаскраски Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.ХранилищеЦвета КАК ХранилищеЦвета
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЦветФонаСтроки = Выборка.ХранилищеЦвета.Получить();
		Если ТипЗнч(ЦветФонаСтроки) = Тип("Цвет") Тогда 
			_УФС.ДобавитьПростоеУсловноеОформление(ЭтаФорма.Список, "Ссылка", , Выборка.Ссылка, Неопределено, "ЦветФона", ЦветФонаСтроки);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхОбъектов(ПоЗначениюОтбора = Истина)
	
	КартиникТипаЗначения 	= Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеКартикиТипуЗначения();
	ДоступныеТипыПоОпциям 	= CW_ЛогистическиеСтатусыСервер.ПолучитьДоступныеТипыПоОпциям();
	мДоступныеТипы 			= Метаданные.ОпределяемыеТипы.CW_ОбъектыЛогистическихСтатусов.Тип.Типы();

	Если ПоЗначениюОтбора Тогда
		КартинкаПоТипу 	= КартиникТипаЗначения.Получить(ТипЗнч(ЗначениеОтбора.ЗначениеПустойСсылки));
		Элементы.ЗначениеОтбора.СписокВыбора.Добавить(ЗначениеОтбора, ЗначениеОтбора.Синоним,,КартинкаПоТипу);
		Возврат;	
	КонецЕсли;
	
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		
		Если ДоступныеТипыПоОпциям.Найти(ТипВладельца) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КартинкаПоТипу 	= КартиникТипаЗначения.Получить(ТипВладельца);
		КартинкаПоТипу 	= ?(КартинкаПоТипу = Неопределено, БиблиотекаКартинок.CW_ГруппаДокументов, КартинкаПоТипу);
		
		Идентификатор 	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
		
		Элементы.ЗначениеОтбора.СписокВыбора.Добавить(Идентификатор,Идентификатор.Синоним,,КартинкаПоТипу);
		
	КонецЦикла;
	
	Элементы.ГруппаОтбор.Видимость =  Элементы.ЗначениеОтбора.СписокВыбора.Количество() > 1;
	
	ЭлементСписка  = Элементы.ЗначениеОтбора.СписокВыбора.Получить(0);
	ЗначениеОтбора = ЭлементСписка.Значение;
	
КонецПроцедуры
